In [1]:
import pandas as pd

In [2]:
df = pd.concat([pd.read_csv('dataset1.csv', dtype=str),pd.read_csv('dataset2.csv', dtype=str)])

In [3]:
# Split the name field into first_name, and last_name
df['first_name'] = df['name'].str.split(' ').str[-2]
df['last_name'] = df['name'].str.split(' ').str[-1]

In [4]:
# Remove any zeros prepended to the price field
df.loc[df['price'].str.contains(r'^0'),'price'] = df[df['price'].str.contains(r'^0')]['price'].str[1:]

In [5]:
# Delete any rows which do not have a name
df = df[~df['name'].isna()]

In [6]:
# Create a new field named above_100, which is true if the price is strictly greater than 100
df['above_100'] = df['price'].astype(float)
df.loc[df['above_100'] > 100, 'above_100'] = True
df.loc[df['above_100'] != True, 'above_100'] = False

In [7]:
df

                 name        price first_name  last_name above_100
0       William Dixon  109.0372796    William      Dixon      True
1        Kristen Horn  262.5246522    Kristen       Horn      True
2      Kimberly Chang  187.0072583   Kimberly      Chang      True
3           Mary Ball  283.1746476       Mary       Ball      True
4      Benjamin Craig  143.8715817   Benjamin      Craig      True
...               ...          ...        ...        ...       ...
4995     Rachel Davis  95.25395533     Rachel      Davis     False
4996  Connie Hamilton  205.3966853     Connie   Hamilton      True
4997      Sean Kaiser  80.54737145       Sean     Kaiser     False
4998  Ebony Rodriguez  93.20561606      Ebony  Rodriguez     False
4999  Gregg Alexander   297.046886      Gregg  Alexander      True

[9961 rows x 5 columns]

In [8]:
df = df[['name', 'first_name', 'last_name', 'price', 'above_100']]

In [9]:
df.to_csv('processed_dataset.csv', index=False)

In [10]:
# Cron schedule: 0 1 * * *